app/views/planes/index.html.erb


        <% if plane.appointments.length != 0 %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."plane_id" = $1  [["plane_id", 2]]