app/views/pilots/index.html.erb


        <% if pilot.appointments.length != 0 %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pilot_id" = $1  [["pilot_id", 2]]