app/views/appointments/_form.html.erb

    <%= form.label :plane_id %><br>
    <%= form.collection_select(:plane_id, Plane.all, :id, :model, {:class => 'form-control'}) %>
---
SELECT "planes".* FROM "planes"

    <%= form.label :pilot_id %><br>
    <%= form.collection_select(:pilot_id, Pilot.all, :id, :name, {:class => 'form-control'}) %>
---
SELECT "pilots".* FROM "pilots"