app/views/appointments/show.html.erb

SELECT  "pilots".* FROM "pilots" WHERE "pilots"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
<br>
<p><%= Pilot.find(@appointment.pilot_id).name %> is booked to rent <%= Plane.find(@appointment.plane_id).registration %></p>